# -*- mode: ruby -*-

# Taps
tap "alphabetum/taps"
tap "sudar/arduino-mk"
tap "homebrew/cask-drivers"

# Apps
cask "android-file-transfer"
cask "arduino"
cask "dashlane"
cask "docker"
cask "eclipse-ide"
cask "emacs"
cask "flux"
cask "font-hack-nerd-font"
cask "google-backup-and-sync"
cask "google-chrome"
cask "intellij-idea-ce"
cask "iterm2"
cask "java"
cask "keepingyouawake"
cask "licecap"
cask "mactex"
cask "mendeley"
cask "minikube"
cask "onedrive"
cask "openemu"
cask "philips-hue-sync"
cask "processing"
cask "slack"
cask "spotify"
cask "synergy"
cask "vagrant"
cask "virtualbox"

# Binary
brew "airport"
brew "ansible"
brew "ant"
brew "arduino-mk"
brew "cmake"
brew "ctags"
brew "detox"
brew "fzf"
brew "gdbm"
brew "go"
brew "gradle"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "languagetool"
brew "nvm"
brew "openssh"
brew "openssl"
brew "pandoc"
brew "q"
brew "rmlint"
brew "shpotify"
brew "sqlite"
brew "ssh-copy-id"
brew "task"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"
