arduino
android-file-transfer
atom
docker
eclipse-ide
google-backup-and-sync
google-chrome
iterm2
font-hack-nerd-font
flux
intellij-idea-ce
java
mactex
mendeley
pulse-sms
processing
sketch
slack
spotify
vagrant
virtualbox
